calendario/app/Controllers/Calendario.php

    public function index()
    {
        // Obtener el año y mes desde la URL (por método GET)
        $year  = $this->request->getVar('year') ?? date('Y');
        $month = $this->request->getVar('month') ?? date('n');
        // Crear una instancia del modelo de eventos
        $model = new \App\Models\EventModel();

        // Obtener todos los eventos almacenados en la base de datos
        $eventos = $model->findAll();
---
SELECT *
FROM `events`

    public function detalle($id)
       {
        require_once ROOTPATH . 'vendor/autoload.php';
            // Crear una instancia del modelo EventModel
            $eventModel = new \App\Models\EventModel();
            // Buscar el evento por su ID
            $evento = $eventModel->find($id);
---
SELECT *
FROM `events`
WHERE `events`.`id` = '19'

    public function editar($id)
    {
        $eventModel = new \App\Models\EventModel();
        // Buscar el evento por ID
        $evento = $eventModel->find($id);
---
SELECT *
FROM `events`
WHERE `events`.`id` = '19'

    public function actualizar($id)
    {
        $eventModel = new \App\Models\EventModel();
        // Buscar el evento por ID
        $evento = $eventModel->find($id);
---
SELECT *
FROM `events`
WHERE `events`.`id` = '19'

            'documento' => $rutaDocumento,
        ];
        // Actualizar el evento en la base de datos
        $eventModel->update($id, $data);
---
UPDATE `events` SET `title` = 'Conferencia de Adaptación Académica', `start` = '2025-06-19T19:30', `end` = '2025-06-19T22:30', `location` = 'centro cívico de Teziutlán', `permax` = '20', `duration` = '03:00:00', `presName` = 'Angel Eduardo Islas Salazar', `documento` = 'uploads/eventos/1747447826_4c78447df696cd315b1c.pptx'
WHERE `events`.`id` IN ('19')

    public function eliminar($id)
    {
        $eventModel = new \App\Models\EventModel();
        // Buscar el evento por ID
        $evento = $eventModel->find($id);
        // Si no existe, lanzar error 404
        if (!$evento) {
            throw \CodeIgniter\Exceptions\PageNotFoundException::forPageNotFound("Evento no encontrado");
        }
        // Eliminar el evento de la base de datos
        $eventModel->delete($id);
---
SELECT *
FROM `events`
WHERE `events`.`id` = '13'
DELETE FROM `events`
WHERE `id` IN ('13')