calendario/app/Controllers/certificado.php

     public function generar($id)
        {
            $eventoModel = new \App\Models\EventModel();
            $evento = $eventoModel->find($id);

            if (!$evento) {
                return redirect()->to('/calendario')->with('error', 'Evento no encontrado.');
            }

            $session = session();
            $userId = $session->get('user_id');
            $nombreAsistente = $session->get('user_name');

            if (!$userId) {
                return redirect()->to('/login')->with('error', 'Debes iniciar sesión para generar el certificado.');
            }

            // Verificar si el usuario está suscrito
            $suscripcionModel = new \App\Models\EventSubscriptionModel();
            $suscripcion = $suscripcionModel
                            ->where('user_id', $userId)
                            ->where('event_id', $id)
                            ->first();
---
SELECT *
FROM `eventos`
WHERE `eventos`.`id` = '11'
SELECT *
FROM `event_subscriptions`
WHERE `user_id` = '8'
AND `event_id` = '11'
 LIMIT 1

    public function suscribirse($evento_id)
    {
        $session = session();
        $userId = $session->get('user_id');
        $eventId = $this->request->getPost('event_id');

        $UserModel = new \App\Models\UserModel();
        $model = new \App\Models\EventSubscriptionModel();
        $EventModel = new \App\Models\EventModel();

        $evento = $EventModel->find($evento_id);
        if (!$evento) {
            return redirect()->back()->with('error', 'El evento no existe.');
        }
        // Usa la variable $UserModel correctamente aquí
        if ($UserModel->find($userId) === null) {
            return redirect()->back()->with('error', 'Usuario no válido');
        }
        if (!$userId) {
            return redirect()->to('/login')->with('error', 'Debes iniciar sesión.');
        }
        if ($evento['estado'] !== 'por_comenzar') {
        return redirect()->back()->with('error', 'No puedes suscribirte a un evento que ya ha comenzado o ha finalizado.');
        }
        // Verifica si ya está suscrito
        if ($model->where('user_id', $userId)->where('event_id', $evento_id)->first()) {
---
SELECT *
FROM `users`
WHERE `users`.`id` = '8'
SELECT *
FROM `event_subscriptions`
WHERE `user_id` = '8'
AND `event_id` = '11'
 LIMIT 1